In [1]:
import pandas as pd
import seaborn as srn
import statistics as sts

In [3]:
dataset = pd.read_csv("Churn.csv",sep =';')
# Nomeando aas coluns
dataset.columns =['Id','Score','Estado','Genero','Idade','Patrimonio','Saldo','Produtos','TemCartCredito','Ativo','Salario','Saiu']
dataset

,Id,Score,Estado,Genero,Idade,Patrimonio,Saldo,Produtos,TemCartCredito,Ativo,Salario,Saiu
0,1,619,RS,Feminino,42,2,0,1,1,1,10134888.0,1
1,2,608,SC,Feminino,41,1,8380786,1,0,1,11254258.0,0
2,3,502,RS,Feminino,42,8,1596608,3,1,0,11393157.0,1
3,4,699,RS,Feminino,39,1,0,2,0,0,9382663.0,0
4,5,850,SC,Feminino,43,2,12551082,1,1,1,790841.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
994,996,838,SC,Masculino,43,9,12310588,2,1,0,14576583.0,0
995,997,610,SC,Masculino,29,9,0,3,0,1,8391224.0,0
996,998,811,SC,Masculino,44,3,0,2,0,1,7843973.0,0
997,999,587,SC,Masculino,62,7,12128627,1,0,1,677692.0,0
998,1000,811,PR,Feminino,28,4,16773882,2,1,1,990342.0,0

In [4]:
# tirando os Vazios de salário e substituindo pela mediana
#calcula a mediana
mediana = sts.median(dataset['Salario'])
mediana

#substitui vazios pelo valor de mediana
dataset ['Salario'].fillna(mediana, inplace = True)

#Verificando se ainda tem algum campo vazio
dataset['Salario'].isnull().sum()

C:\Users\ingri\AppData\Local\Temp\ipykernel_12692\1593504694.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset ['Salario'].fillna(mediana, inplace = True)

0

In [5]:
# Padronizando Genero e Limpando valores vazios

#agrupando por genero para ver os valores
group_genero=dataset.groupby(['Genero']).size()
group_genero

Genero
F              2
Fem            1
Feminino     461
M              6
Masculino    521
dtype: int64

In [6]:
#somando as NA's
dataset['Genero'].isnull().sum()

8

In [7]:
#Preenchendo os registros vazios com a moda
dataset['Genero'].fillna('Masculino', inplace =True)
dataset['Genero'].isnull().sum()

#Padronizando os Registros
dataset.loc[dataset['Genero']=='M','Genero']='Masculino'
dataset.loc[dataset['Genero'].isin(['Fem','F']), 'Genero']= 'Feminino'

group_genero=dataset.groupby(['Genero']).size()
group_genero

C:\Users\ingri\AppData\Local\Temp\ipykernel_12692\2042117500.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset['Genero'].fillna('Masculino', inplace =True)

Genero
Feminino     464
Masculino    535
dtype: int64

In [8]:
# Idade fora do dominio
dataset['Idade'].describe()
# nessa coluna temos campos de idade que nao fazem sentido, numeros menores que zero e numeros como 140

count    999.000000
mean      38.902903
std       11.401912
min      -20.000000
25%       32.000000
50%       37.000000
75%       44.000000
max      140.000000
Name: Idade, dtype: float64

In [9]:
# Analisando o tamanho do Problema
dataset.loc[(dataset['Idade']< 0) |(dataset['Idade'] > 120) ]

,Id,Score,Estado,Genero,Idade,Patrimonio,Saldo,Produtos,TemCartCredito,Ativo,Salario,Saiu
867,869,636,RS,Feminino,-10,1,17083346,1,1,0,11051028.0,1
984,986,773,RS,Masculino,-20,1,12453278,2,0,1,1172357.0,0
990,992,655,RS,Masculino,140,5,93147,2,1,0,6621413.0,0

In [10]:
# Calculando a mediana
mediana =sts.median(dataset['Idade'])
mediana

37

In [11]:
dataset.loc[(dataset['Idade']< 0) |(dataset['Idade'] > 120), 'Idade'] = mediana

In [12]:
#Verificando se ainda existe idade fora do dominio
dataset.loc[(dataset['Idade']<0) | (dataset['Idade']>120)]

Empty DataFrame
Columns: [Id, Score, Estado, Genero, Idade, Patrimonio, Saldo, Produtos, TemCartCredito, Ativo, Salario, Saiu]
Index: []

In [13]:
#buscando dados duplicados pelo ID
dataset[dataset.duplicated(['Id'], keep=False)]

,Id,Score,Estado,Genero,Idade,Patrimonio,Saldo,Produtos,TemCartCredito,Ativo,Salario,Saiu
80,81,665,RS,Feminino,34,1,9664554,2,0,0,17141366.0,0
81,81,665,RS,Feminino,34,1,9664554,2,0,0,17141366.0,0

In [16]:
#excluindo id duplicado
dataset.drop_duplicates(subset='Id', keep ='first',inplace=True)
dataset[dataset.duplicated(['Id'], keep=False)]

Empty DataFrame
Columns: [Id, Score, Estado, Genero, Idade, Patrimonio, Saldo, Produtos, TemCartCredito, Ativo, Salario, Saiu]
Index: []

In [17]:
#Estado fora do dominio
agrupado =dataset.groupby(['Estado']).size()
agrupado

Estado
PR    257
RP      1
RS    477
SC    258
SP      4
TD      1
dtype: int64

In [18]:
#atribindo a moda nos estados mal preenchidos
dataset.loc[dataset['Estado'].isin(['RP','SP','TD']),'Estado'] = 'RS'

In [ ]:
#Validando o resultado
agrupado =dataset.groupby(['Estado']).size()
agrupado

Estado
PR    257
RS    483
SC    258
dtype: int64

In [20]:
#salarios, vamos considerar 2 divios padrão
desv= sts.stdev(dataset['Salario'])
desv

528988918.4679201

In [21]:
dataset.loc[dataset['Salario']>= 2*desv]

,Id,Score,Estado,Genero,Idade,Patrimonio,Saldo,Produtos,TemCartCredito,Ativo,Salario,Saiu
7,8,376,PR,Feminino,29,4,11504674,4,1,0,1.193469e+10,1
116,118,668,PR,Feminino,37,6,1678644,1,1,0,1.156383e+10,0
170,172,484,RS,Feminino,29,4,13011439,1,1,0,1.640179e+09,0
230,232,673,RS,Masculino,72,1,0,2,0,1,1.119812e+09,0

In [22]:
mediana = sts.median(dataset['Salario'])
mediana

8637195.5

In [23]:
dataset.loc[dataset['Salario']>=2 * desv, 'Salario'] = mediana

dataset.loc[dataset['Salario']>=2 * desv]

Empty DataFrame
Columns: [Id, Score, Estado, Genero, Idade, Patrimonio, Saldo, Produtos, TemCartCredito, Ativo, Salario, Saiu]
Index: []

In [24]:
dataset.head()

,Id,Score,Estado,Genero,Idade,Patrimonio,Saldo,Produtos,TemCartCredito,Ativo,Salario,Saiu
0,1,619,RS,Feminino,42,2,0,1,1,1,10134888.0,1
1,2,608,SC,Feminino,41,1,8380786,1,0,1,11254258.0,0
2,3,502,RS,Feminino,42,8,1596608,3,1,0,11393157.0,1
3,4,699,RS,Feminino,39,1,0,2,0,0,9382663.0,0
4,5,850,SC,Feminino,43,2,12551082,1,1,1,790841.0,0

In [25]:
dataset.shape

(998, 12)